Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/introduction_to_the_irish_system/moving_your_child_irish_primary_school.html.txt.tmx
Source language: en
Languages: ga

source: Moving your children to primary school
ga: Do pháiste a aistriú chuig bunscoil in Éirinn

source: If you are moving to Ireland and you have a child of school-going age, you will need information about the educational choices available to you and the procedures involved in getting your child enrolled
ga: Má tá tú ag teacht go hÉirinn agus páiste in aois scoile agat beidh ort teacht ar eolas maidir leis na roghanna oideachais atá ann duit agus a bhfuil le déanamh leis an bpáiste a chlárú sa scoil

source: The dates of the school year for primary school children are not standardised but all schools are closed for July and most (or all) of August
ga: Is ón 1éad Meán Fómhair go dtí 30ú Meitheamh a mhaireann an bhliain scoile do pháiste bunscoile in Éirinn

source: Children attend primary school from around the age of 4 or 5 years until they are 12 or 13 years of age
ga: Bíonn páistí ag freastal ar an scoil ó aois tuairim is 4 nó 5 go dtí go mbíonn siad 12 nó 13 bliain d’aois

source: The primary school cycle is 8 years long
ga: Ocht mbliana ar fad atá sa chóras bunscoile

source: Schools generally have 2 years of infant classes, followed by class 1 to class 6
ga: Bíonn dhá bhliain go ginearálta den chiondarghairdín ag scoileanna, agus ansin ina dhiaidh sin ranganna 1 go dtí 6

source: Your child will not be obliged to attend school before the age of 6. However, Irish children attend school at age 4 or 5
ga: Níl aon dualgas ort do pháiste a chur chuig an scoil roimh 6 bliana, ach de gnáth bíonn páistí in Éirinn ag freastal ar an scoil chomh hóg le 4

source: Pre-school education is available for children from the age of 3 to 5 and a half years under the Early Childhood Care and Education (ECCE) Scheme
ga: Mar gheall ar seo bíonn na ranganna is óige sa bhunscoil ag ple le rudaí a bheadh déanta i dtíortha eile sa chóras réamhscoile

source: You also have a constitutional right to educate your child at home
ga: Tá ceart bunreachtúil agat freisin oideachas a chur ar do pháiste ag baile

source: However, this is not common practice
ga: Ach ní tharlaíonn seo go minic

source: The types of schools available
ga: Cineálacha scoileanna atá ar fáil

source: The primary education sector consists of State-funded primary schools, special schools and private primary schools
ga: Scoileanna maoinithe ag an Stáit, chomh maith le scoileanna speisialta agus bunscoileanna príobháideacha iad bunscoileanna na hÉireann

source: State-funded primary schools used to be known as national schools and you may still hear this term being used
ga: Scoileanna náisiúnta a tugadh ar bhunscoileanna maoinithe ag an Stáit agus cloistear an téarma seo in úsáid fós

source: State-funded schools include religious schools, multi-denominational schools and Gaelscoileanna, which are schools that teach the curriculum through the Irish language
ga: San áireamh le scoileanna atá maoinithe ag an Stáit tá scoileanna creidimh, scoileanna illaicme agus Gaelscoileanna a bhíonn ag teagasc tré mheán na Gaeilge

source: You can find a list of State-funded primary schools on the Department of Education and Skills website
ga: Tá liosta bhunscoileanna maoinithe ag an Stáit ar fáil ar an suíomh gréasáin Roinn Oideachais agus Scileanna

source: Religion in Irish schools
ga: Creideamh i Scoileanna na hÉireann

source: Most primary schools are under the management of one denomination or another and the majority of these are Roman Catholic
ga: Scoileanna aon chreideamh iad formhór bunscoileanna na hÉireann agus is scoileanna Caitliceacha iad an chuid is mó acu

source: There is, however, a growing choice of schools of other denominations and of multi-denominational schools
ga: Tá, áfach, fás ag teacht ar an méid scoileanna illaicme

source: Schools that cater for a single religion may give priority to children of that religion but they may also admit children with other religious beliefs, or none
ga: Scoileanna a bhíonn ag plé le creideamh amháin tugann siad tús áite do pháistí den chreideamh sin ach tá siad sásta glacadh le páistí ó chreidimh eile, nó gan creideamh

source: Children do not have to attend religion classes and you may choose to withdraw your child from such classes if you wish
ga: Níl aon dualgas ar ghasúir freastal ar ranganna creidimh agus is féidir leat an rogha a dhéanamh do pháiste a choinneáil ó na ranganna sin

source: Regardless of religion, all primary schools operate under similar rules
ga: Is cuma cén creideamh atá acu, bíonn na bunscoileanna ar fad ag oibriú faoi mórán na rialacha céanna

source: The main differences relate to the appointment of the principal of the school and the choice of teacher representatives on the Board of Management
ga: Baineann na príomhdhifríochtaí le ceapuchán príomhoide na scoile agus rogha ionadaí na múinteoirí ar an mBord Bainistíochta

source: The Irish primary school curriculum is child-centred
ga: Tá curaclam bunscoileanna na hÉireann dírithe ar an bpáiste

source: Certain children who come to live in Ireland may be exempted from learning Irish in school
ga: • Ról lárnach ag foghlaim agus modhanna teagaisc imeachtaí agus nochtú faoi threoir

source: You should, in theory, be able to send your child to the school of your choice
ga: Ba cheart, de réir teoirice, go mbeadh tú in ann do pháiste a chur chuig do rogha scoil

source: However, when it comes to enrolling your child, you may find that there is little or no choice in the area in which you live
ga: Ach, nuair atá páiste le clárú agat sa scoil d'fhéadfadh sé nach mbeidh mórán nó aon rogha agat ag brath ar an áit ina bhfuil cónaí ort

source: Each school operates an admissions policy, which they must make available on request
ga: Bíonn polasaí iontrála ag gach scoil, polasaí nach mór dóibh a chur ar fáil má iarrtar é

source: It is important to ask for the admissions policy of any school in which you are interested
ga: Tá sé tábhachtach an polasaí iontrála atá ag an scoil a bhfuil spéis agat inti a lorg

source: State-funded primary schools tend to give priority to children living in the immediate area, but problems can arise if their classes are already full and they have a waiting list
ga: Is iondúil go dtugann bunscoileanna stáit tús áite do pháistí atá ina gcónaí sa cheantar ach, bíonn fadhbanna ann má tá na ranganna lán cheana agus liosta feithimh acu

source: Multi-denominational schools and Gaelscoileanna each decide their own admissions policy
ga: Déanann scoileanna illaicme agus Gaelscoileanna cinneadh ar a gcuid polasaithe iontrála féin

source: Some secondary schools give priority to students coming from particular primary schools so it may be useful to plan ahead when choosing a primary school for your child
ga: Tugann roinnt meánscoileanna tús áite do mhic léinn a thagann as bunscoileanna faoi leith agus mar sin b'fhéidir gur ceart breathnú ar an todhchaí agus bunscoil dhá roghnú agat do do pháiste

source: Children are entitled to free primary and post-primary education
ga: Is iondúil go bhfaighfidh do pháiste áit sa scoil náisiúnta is giorra do d'áit chónaithe

source: The majority of primary schools are State-funded which means that you will not have to pay annual fees for your child's education
ga: Níl sé seo iomlán cinnte, áfach, ní bheidh cead iontrála ag páiste má tá an scoil lán cheana

source: In practice, however, schools often need to raise extra funds for additional resources such as computers, sports equipment or improved facilities
ga: Is féidir leat do pháiste a chur chuig aon scoil phríobháideach is mian leat, ach áit a bheith ar fáil inti agus na táillí cuí a íoc. Rátaí

source: You may be asked to make a contribution or to take part in fund-raising for the school, but your participation in these activities must always be voluntary
ga: Tá páistí in Éirinn i dteideal oideachas bunscoile agus iar-bhunscoile saor in aisce a fháil. Tá formhór na mbunscoileanna maoinithe ag an Stáit agus mar sin níl aon táille bhliantúil le n-íoc agat ar son oideachas do pháiste

source: State-funded schools cannot require you to make contributions
ga: Ní féidir le scoileanna atá maoinithe ag an Stáit iachall a chur ort páirt a ghlacadh in imeachtaí le hairgead a bhailiú

source: If you choose to send your child to a private school, you will have to pay annual fees
ga: Má roghnaíonn tú do pháiste a chur chuig scoil phríobháideach beidh ort táillí a íoc

source: These can vary considerably from school to school
ga: Beidh an-difríocht idir na táillí seo ag brath ar an scoil

source: Contact the school of your choice to ask for details of fees and other expenses
ga: Déan teagmháil le do rogha scoil le heolas faoi na táillí agus costais eile a fháil

source: Contact the school to which you want to send your child
ga: Déan teagmháil leis an scoil gur mian leat do pháiste a chur chuici

source: Ask for their admissions policy and check whether you need to register your child's name on a waiting list
ga: Iarr ar an scoil an polasaí iontrála atá acu a chur chugat agus fáigh amach an gá ainm do pháiste a chur ar liosta feithimh

source: You can find out more about starting primary school here
ga: Leigh tuilleadh eolais faointosú ar bhunscoil anseo
